In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.read_csv('./pokemon.csv')

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [8]:
df_pokemon = pd.read_csv('pokemon.csv', index_col='Pokemon') #A coluna Pokemon passou agora a ser o índice, porém ainda é um DataFrame e nãouma série

In [ ]:
df_pokemon = df_pokemon.squeeze() #Torna o DataFrame em Série 
df_pokemon

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

In [32]:
df_google_stocks = pd.read_csv('google_stocks.csv')
df_google_stocks.head()

         Date  Close
0  2004-08-19  49.98
1  2004-08-20  53.95
2  2004-08-23  54.50
3  2004-08-24  52.24
4  2004-08-25  52.80

In [33]:
df_google_stocks = pd.read_csv('google_stocks.csv', parse_dates=['Date']) #Tranformou os valores da coluna Date de string para datetime com o parâmetro parse_dates
df_google_stocks.head()

        Date  Close
0 2004-08-19  49.98
1 2004-08-20  53.95
2 2004-08-23  54.50
3 2004-08-24  52.24
4 2004-08-25  52.80

In [44]:
df_google_stocks = pd.read_csv('google_stocks.csv', parse_dates=['Date'], index_col='Date')
df_google_stocks = df_google_stocks.squeeze()
df_google_stocks.head()

Date
2004-08-19    49.98
2004-08-20    53.95
2004-08-23    54.50
2004-08-24    52.24
2004-08-25    52.80
Name: Close, dtype: float64

In [17]:
df_revolutionary_war = pd.read_csv('revolutionary_war.csv')
df_revolutionary_war.tail()

                         Battle  Start Date     State
227         Siege of Fort Henry   9/11/1782  Virginia
228  Grand Assault on Gibraltar   9/13/1782       NaN
229   Action of 18 October 1782  10/18/1782       NaN
230   Action of 6 December 1782   12/6/1782       NaN
231   Action of 22 January 1783   1/22/1783  Virginia

In [18]:
df_revolutionary_war = pd.read_csv('revolutionary_war.csv', index_col='Start Date')
df_revolutionary_war.tail()

                                Battle     State
Start Date
9/11/1782          Siege of Fort Henry  Virginia
9/13/1782   Grand Assault on Gibraltar       NaN
10/18/1782   Action of 18 October 1782       NaN
12/6/1782    Action of 6 December 1782       NaN
1/22/1783    Action of 22 January 1783  Virginia

In [45]:
df_revolutionary_war = pd.read_csv('revolutionary_war.csv', index_col='Start Date', parse_dates=['Start Date'], usecols=['State', 'Start Date'])
df_revolutionary_war = df_revolutionary_war.squeeze()
df_revolutionary_war.tail()

Start Date
1782-09-11    Virginia
1782-09-13         NaN
1782-10-18         NaN
1782-12-06         NaN
1783-01-22    Virginia
Name: State, dtype: object

In [ ]:
df_google_stocks.sort_values() #Coloca os valores em ordem do menor para o maior por padrão

Date
2004-09-03      49.82
2004-09-01      49.94
2004-08-19      49.98
2004-09-02      50.57
2004-09-07      50.60
               ...
2019-04-23    1264.55
2019-10-25    1265.13
2018-07-26    1268.33
2019-04-26    1272.18
2019-04-29    1287.58
Name: Close, Length: 3824, dtype: float64

In [ ]:
df_pokemon.sort_values() #Coloca os valores em ordem alfabética

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [ ]:
pd.Series(data = ['Adam', 'adam', 'Ben']).sort_values() #As letras maiúsculas ficam antes das minúsculas

0    Adam
2     Ben
1    adam
dtype: object

In [ ]:
df_google_stocks.sort_values(ascending=False).head() #Inverteu a ordem com o parâmetro ascending = False

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [ ]:
df_pokemon.sort_values(ascending=False) #Inverteu a ordem

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

In [ ]:
df_revolutionary_war.sort_values(na_position='last') #agrupa todos os valores NaN no final da série, caso queira os valores NaN no início da série é só trocar 'last' por 'first'

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [ ]:
df_revolutionary_war.dropna().sort_values() #Todos os índices com valores NaN foram retirados da série, como pode ser observado no número de linhas que diminuiu de 232 para 162

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1781-07-06       Virginia
1781-07-01       Virginia
1781-06-26       Virginia
1781-04-25       Virginia
1783-01-22       Virginia
Name: State, Length: 162, dtype: object

In [ ]:
df_pokemon.sort_index() #Ordena os índices pela ordem crescente alfabética

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [ ]:
df_revolutionary_war.sort_index() #Ordena o índice do menor para o maior

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [ ]:
df_revolutionary_war.sort_index(na_position='first') #Ordenou os índices com dados NaT (not a time) para o começo da série

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [ ]:
df_google_stocks.nlargest(n=5) #Retorna os valores mais altos da série, neste caso os 5 valores maiores

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [ ]:
df_google_stocks.nsmallest(5) #Retorna os 5 valores mais baixos da série

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
Name: Close, dtype: float64

In [56]:
df_revolutionary_war.head(3)

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
Name: State, dtype: object

In [ ]:
df_pokemon.value_counts() #Agrupou e contou a quantidade dos tipos de pokemons

Type
Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: count, Length: 159, dtype: int64

In [ ]:
df_pokemon.value_counts(normalize=True).head() #retorna a frequência de cada valor único

Type
Normal     0.080346
Water      0.075402
Grass      0.046972
Psychic    0.043263
Fire       0.037083
Name: proportion, dtype: float64

In [61]:
df_pokemon.value_counts(normalize=True).head().mul(100) #Multiplicou por 100 para dar a porcentagem que cada tipo de Pokemon contribui na série

Type
Normal     8.034611
Water      7.540173
Grass      4.697157
Psychic    4.326329
Fire       3.708282
Name: proportion, dtype: float64

In [ ]:
df_pokemon.value_counts(normalize=True).head().mul(100).round(2) #O método round arredondou os números com 2 casas decimais

Type
Normal     8.03
Water      7.54
Grass      4.70
Psychic    4.33
Fire       3.71
Name: proportion, dtype: float64

In [63]:
df_google_stocks.value_counts().head()

Close
287.68    3
194.27    3
307.10    3
288.92    3
290.41    3
Name: count, dtype: int64

In [ ]:
buckets = [0, 200, 400, 600, 800, 1000, 1200, 1400]
df_google_stocks.value_counts(bins=buckets).sort_index() 
#Foi feito uma lista de 0 a 1400 com instervalos de 200 para classificar a diferença do menor valor para o maior dentro de cada intervalo. Entre os valores de 1200 e 1400 aparecem 93 vezes, por exemplo. A maioria dos valores estão entre 200 e 400 neste caso. O intervalo de captura de todos os valores maiores que, possui um '(' marcando um valor excludente do intervalo, como no caso de -0.001 e menores ou iguais, possui um ']' marcando um valor includente do intervalo, no caso do 200.
#O parâmetro bin retorna intervalos semiabertos, neste caso a lista com os valores estabelecidos na lista como guias
# Poderia escrever desse jeito também 'google.value_counts(bins = buckets, sort = False)'

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: count, dtype: int64

In [ ]:
df_google_stocks.value_counts(bins=6, sort = False) #Dividiu em 6 grupos os valores e a ordem ficou do maior para o menor

(48.581, 256.113]      1204
(256.113, 462.407]     1104
(462.407, 668.7]        507
(668.7, 874.993]        380
(874.993, 1081.287]     292
(1081.287, 1287.58]     337
Name: count, dtype: int64

In [ ]:
df_revolutionary_war.value_counts().head() #Por padrão o pandas retira os falores NaN da contagem

State
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Massachusetts     11
Name: count, dtype: int64

In [ ]:
df_revolutionary_war.value_counts(dropna=False).head() #dropna mostra a quantidade de valores NaN

State
NaN               70
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Name: count, dtype: int64

In [69]:
df_revolutionary_war.index

DatetimeIndex(['1774-09-01', '1774-12-14', '1775-04-19', '1775-04-19',
               '1775-04-20', '1775-05-10', '1775-05-27', '1775-06-11',
               '1775-06-17', '1775-08-08',
               ...
               '1782-08-08', '1782-08-15', '1782-08-19', '1782-08-26',
               '1782-08-25', '1782-09-11', '1782-09-13', '1782-10-18',
               '1782-12-06', '1783-01-22'],
              dtype='datetime64[ns]', name='Start Date', length=232, freq=None)

In [ ]:
df_revolutionary_war.index.value_counts() #Conta quantas vezes aparece o mesmo índice na série

Start Date
1781-04-25    2
1781-05-22    2
1780-08-18    2
1781-09-13    2
1782-03-16    2
             ..
1778-06-30    1
1778-07-03    1
1778-07-27    1
1778-08-21    1
1783-01-22    1
Name: count, Length: 217, dtype: int64

In [71]:
funcs = [len, max, min]

In [76]:
for current_func in funcs:
    print(current_func(df_google_stocks))

3824
1287.58
49.82

In [ ]:
df_google_stocks.apply(round) #Apply invoca uma função, neste caso a função round e arredonda para todos os valores

Date
2004-08-19      50
2004-08-20      54
2004-08-23      54
2004-08-24      52
2004-08-25      53
              ...
2019-10-21    1246
2019-10-22    1243
2019-10-23    1259
2019-10-24    1261
2019-10-25    1265
Name: Close, Length: 3824, dtype: int64

In [ ]:
#Função criada para classificar Pokemons como multiplos ou únicos
def single_or_multi(pokemon_type):
    if '/' in pokemon_type:
        return 'multi'
    return 'Single'

In [80]:
df_pokemon.apply(single_or_multi)

Pokemon
Bulbasaur       multi
Ivysaur         multi
Venusaur        multi
Charmander     Single
Charmeleon     Single
                ...
Stakataka       multi
Blacephalon     multi
Zeraora        Single
Meltan         Single
Melmetal       Single
Name: Type, Length: 809, dtype: object

In [81]:
df_pokemon.apply(single_or_multi).value_counts()

Type
multi     405
Single    404
Name: count, dtype: int64

###Exercício

In [91]:
import datetime as dt
today = dt.datetime(2006, 2, 25)
today.strftime('%A')

'Saturday'

In [112]:
days_of_wars = pd.read_csv(
    'revolutionary_war.csv',
    usecols=['Start Date'],
    parse_dates=['Start Date']
)
days_of_wars.squeeze()

0     1774-09-01
1     1774-12-14
2     1775-04-19
3     1775-04-19
4     1775-04-20
         ...
227   1782-09-11
228   1782-09-13
229   1782-10-18
230   1782-12-06
231   1783-01-22
Name: Start Date, Length: 232, dtype: datetime64[ns]

In [115]:
def day_of_week(date):
    return date.dt.strftime('%A')

In [117]:
days_of_wars.dropna().apply(day_of_week).value_counts()

Start Date
Friday        39
Saturday      39
Wednesday     32
Sunday        31
Thursday      31
Tuesday       29
Monday        27
Name: count, dtype: int64